import React from 'react';

function Popup(props) {

    const { handleClose } = props;

    return (
        <div className="popup">
            <div className="popup__content">
                <svg onClick={handleClose} className="popup__close" width="18" height="18" viewBox="0 0 18 18" fill="none"
                     xmlns="http://www.w3.org/2000/svg">
                    <path
                        d="M17.707 17.0001C18.0976 16.6096 18.0976 15.9764 17.707 15.5859L11.1213 9.00012L17.7072 2.41421C18.0977 2.02369 18.0977 1.39052 17.7072 0.999998L17.0003 0.29309C16.6098 -0.0974337 15.9766 -0.0974338 15.5861 0.29309L9.00016 6.879L2.41426 0.293046C2.02373 -0.0974785 1.39057 -0.0974785 1.00005 0.293046L0.293138 0.999953C-0.0973868 1.39048 -0.0973871 2.02364 0.293137 2.41417L6.87905 9.00012L0.293501 15.5857C-0.0970228 15.9762 -0.0970225 16.6094 0.293502 16.9999L1.00041 17.7068C1.39093 18.0973 2.0241 18.0973 2.41462 17.7068L9.00016 11.1212L15.5859 17.707C15.9764 18.0975 16.6096 18.0975 17.0001 17.707L17.707 17.0001Z"
                        fill="#121417"/>
                </svg>
                <h3 className="popup__title">TITLE</h3>
                <div className="popup__chat">

                </div>
                <form className="popup__form">
                    <input type="text" name="name" className="popup__input popup__input_type_name"
                           placeholder="Сообщение"/>
                    <button type className="button popup__button">
                        <svg width="22" height="28" viewBox="0 0 22 28" fill="none"
                             xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M0.728659 12.2754C0.20796 11.7547 0.20796 10.9105 0.728659 10.3898L10.0573 1.06112C10.3177 0.800763 10.6589 0.670588 11.0002 0.670593C11.3414 0.670588 11.6826 0.800763 11.943 1.06112L21.2743 10.3925C21.795 10.9132 21.795 11.7574 21.2743 12.2781L20.3315 13.2209C19.8108 13.7416 18.9666 13.7416 18.4459 13.2209L13.0031 7.77807V26C13.0031 26.7364 12.4061 27.3334 11.6698 27.3334H10.3303C9.59394 27.3334 8.99699 26.7364 8.99699 26V7.77832L3.55709 13.2182C3.03639 13.7389 2.19217 13.7389 1.67147 13.2182L0.728659 12.2754Z"
                                fill="#F6F4F5"/>
                        </svg>
                    </button>
                </form>
            </div>
        </div>
    )
}


export default Popup;
